---
kind: method
id: M:Autodesk.Revit.DB.Analysis.SpatialFieldManager.Clear
source: html/820f2357-0b84-a348-7814-0e966683c225.htm
---
# Autodesk.Revit.DB.Analysis.SpatialFieldManager.Clear Method

Clear all analysis results managed by this manager object

## Syntax (C#)
```csharp
public void Clear()
```